```
=========> Existing resources:
[command]/usr/local/vss-agent/2.309.0/_work/_temp/aff08ab4-5030-4f40-a687-064521a6c9cb/terraform-bin state list
module.acr.data.azurerm_container_registry_scope_map.pull
module.acr.data.azurerm_container_registry_scope_map.push
module.acr.azurerm_container_registry.this
module.acr.azurerm_container_registry_token.pull
module.acr.azurerm_container_registry_token.push
module.acr.azurerm_container_registry_token_password.pull_password
module.acr.azurerm_container_registry_token_password.push_password
module.acr.azurerm_private_dns_a_record.data
module.acr.azurerm_private_dns_a_record.login_server
module.acr.azurerm_private_dns_zone.pdz
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private
module.acr.azurerm_private_endpoint.pep
module.acr.azurerm_subnet.acr
module.acr.azurerm_subnet.container_apps
module.acr.azurerm_virtual_network.vnet
module.container_apps.azurerm_application_insights.this
module.docker_image.docker_image.proxy
module.docker_image.docker_registry_image.proxy
module.docker_image.null_resource.go_code_keeper
module.endpoint_blob.azurerm_storage_account.endpoint
module.endpoint_blob.azurerm_storage_blob.endpoint
module.endpoint_blob.azurerm_storage_container.endpoint
module.resource_group.azurerm_resource_group.this
module.acr.module.public_ip.data.curl.big_data_cloud
module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]
module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env
module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]
::debug::Terraform exited with code 0.
::debug::stdout: module.acr.data.azurerm_container_registry_scope_map.pull%0Amodule.acr.data.azurerm_container_registry_scope_map.push%0Amodule.acr.azurerm_container_registry.this%0Amodule.acr.azurerm_container_registry_token.pull%0Amodule.acr.azurerm_container_registry_token.push%0Amodule.acr.azurerm_container_registry_token_password.pull_password%0Amodule.acr.azurerm_container_registry_token_password.push_password%0Amodule.acr.azurerm_private_dns_a_record.data%0Amodule.acr.azurerm_private_dns_a_record.login_server%0Amodule.acr.azurerm_private_dns_zone.pdz%0Amodule.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private%0Amodule.acr.azurerm_private_endpoint.pep%0Amodule.acr.azurerm_subnet.acr%0Amodule.acr.azurerm_subnet.container_apps%0Amodule.acr.azurerm_virtual_network.vnet%0Amodule.container_apps.azurerm_application_insights.this%0Amodule.docker_image.docker_image.proxy%0Amodule.docker_image.docker_registry_image.proxy%0Amodule.docker_image.null_resource.go_code_keeper%0Amodule.endpoint_blob.azurerm_storage_account.endpoint%0Amodule.endpoint_blob.azurerm_storage_blob.endpoint%0Amodule.endpoint_blob.azurerm_storage_container.endpoint%0Amodule.resource_group.azurerm_resource_group.this%0Amodule.acr.module.public_ip.data.curl.big_data_cloud%0Amodule.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]%0Amodule.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env%0Amodule.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]%0A
::debug::stderr: 
::debug::exitcode: 0
[command]/usr/local/vss-agent/2.309.0/_work/_temp/aff08ab4-5030-4f40-a687-064521a6c9cb/terraform-bin show -no-color tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker_image.docker_image.proxy has been deleted
  - resource "docker_image" "proxy" {
        id       = "sha256:fa7579f41ed6458e5bef18b293f4f81f63791816dc4fc225bf579ced4c2dbd8bavmtelemetry.azurecr.io/telemetry_proxy"
      - name     = "avmtelemetry.azurecr.io/telemetry_proxy" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.docker_image.docker_registry_image.proxy has been deleted
  - resource "docker_registry_image" "proxy" {
        id                   = "sha256:007b780c51f106eb157264b7115e4a26222778032c0723a3e1b4a6bf8450a3c9"
      - name                 = "avmtelemetry.azurecr.io/telemetry_proxy" -> null
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.acr.data.azurerm_container_registry_scope_map.pull will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "pull" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_pull"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.data.azurerm_container_registry_scope_map.push will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "push" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_push"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.azurerm_container_registry.this will be updated in-place
  ~ resource "azurerm_container_registry" "this" {
        id                            = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry"
        name                          = "avmtelemetry"
      ~ network_rule_set              = [
          ~ {
              ~ ip_rule         = (sensitive value)
                # (2 unchanged attributes hidden)
            },
        ]
        tags                          = {}
        # (15 unchanged attributes hidden)
    }

  # module.docker_image.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"
      + repo_digest = (known after apply)
      + triggers    = {
          + "code_hash"  = "b49c3f11e0f8641261e42ae428a8a9ad"
          + "dockerfile" = "260b798ab8e87ead5afd25c4bfb11577"
        }

      + build {
          + cache_from   = []
          + context      = "docker_image"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",
            ]
        }
    }

  # module.docker_image.docker_registry_image.proxy will be created
  + resource "docker_registry_image" "proxy" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "avmtelemetry.azurecr.io/telemetry_proxy"
      + sha256_digest        = (known after apply)
    }

  # module.docker_image.null_resource.go_code_keeper must be replaced
-/+ resource "null_resource" "go_code_keeper" {
      ~ id       = "6642159707818772006" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "code_hash"  = "44213dc42526af8cfd7acfb42d5dd031" -> "b49c3f11e0f8641261e42ae428a8a9ad"
            # (1 unchanged element hidden)
        }
    }

Plan: 3 to add, 1 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.docker_image.docker_image.proxy has been deleted%0A  - resource "docker_image" "proxy" {%0A        id       = "sha256:fa7579f41ed6458e5bef18b293f4f81f63791816dc4fc225bf579ced4c2dbd8bavmtelemetry.azurecr.io/telemetry_proxy"%0A      - name     = "avmtelemetry.azurecr.io/telemetry_proxy" -> null%0A        # (2 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.docker_image.docker_registry_image.proxy has been deleted%0A  - resource "docker_registry_image" "proxy" {%0A        id                   = "sha256:007b780c51f106eb157264b7115e4a26222778032c0723a3e1b4a6bf8450a3c9"%0A      - name                 = "avmtelemetry.azurecr.io/telemetry_proxy" -> null%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.acr.data.azurerm_container_registry_scope_map.pull will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_container_registry_scope_map" "pull" {%0A      + actions                 = (known after apply)%0A      + container_registry_name = "avmtelemetry"%0A      + description             = (known after apply)%0A      + id                      = (known after apply)%0A      + name                    = "_repositories_pull"%0A      + resource_group_name     = "avm-telemetry"%0A    }%0A%0A  # module.acr.data.azurerm_container_registry_scope_map.push will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_container_registry_scope_map" "push" {%0A      + actions                 = (known after apply)%0A      + container_registry_name = "avmtelemetry"%0A      + description             = (known after apply)%0A      + id                      = (known after apply)%0A      + name                    = "_repositories_push"%0A      + resource_group_name     = "avm-telemetry"%0A    }%0A%0A  # module.acr.azurerm_container_registry.this will be updated in-place%0A  ~ resource "azurerm_container_registry" "this" {%0A        id                            = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry"%0A        name                          = "avmtelemetry"%0A      ~ network_rule_set              = [%0A          ~ {%0A              ~ ip_rule         = (sensitive value)%0A                # (2 unchanged attributes hidden)%0A            },%0A        ]%0A        tags                          = {}%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.docker_image.docker_image.proxy will be created%0A  + resource "docker_image" "proxy" {%0A      + id          = (known after apply)%0A      + image_id    = (known after apply)%0A      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"%0A      + repo_digest = (known after apply)%0A      + triggers    = {%0A          + "code_hash"  = "b49c3f11e0f8641261e42ae428a8a9ad"%0A          + "dockerfile" = "260b798ab8e87ead5afd25c4bfb11577"%0A        }%0A%0A      + build {%0A          + cache_from   = []%0A          + context      = "docker_image"%0A          + dockerfile   = "Dockerfile"%0A          + extra_hosts  = []%0A          + remove       = true%0A          + security_opt = []%0A          + tag          = [%0A              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",%0A            ]%0A        }%0A    }%0A%0A  # module.docker_image.docker_registry_image.proxy will be created%0A  + resource "docker_registry_image" "proxy" {%0A      + id                   = (known after apply)%0A      + insecure_skip_verify = false%0A      + keep_remotely        = true%0A      + name                 = "avmtelemetry.azurecr.io/telemetry_proxy"%0A      + sha256_digest        = (known after apply)%0A    }%0A%0A  # module.docker_image.null_resource.go_code_keeper must be replaced%0A-/+ resource "null_resource" "go_code_keeper" {%0A      ~ id       = "6642159707818772006" -> (known after apply)%0A      ~ triggers = { # forces replacement%0A          ~ "code_hash"  = "44213dc42526af8cfd7acfb42d5dd031" -> "b49c3f11e0f8641261e42ae428a8a9ad"%0A            # (1 unchanged element hidden)%0A        }%0A    }%0A%0APlan: 3 to add, 1 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```